/*******************************************************************************************************
Описание: Файл работы с SysTick
Разработчик: Хомутов Евгений
Заметки:
*******************************************************************************************************/
#include <stdint.h>
#include <stdbool.h>
#include <misc.h>

/***************************************************************************************************
Локальные дефайны
***************************************************************************************************/
/**************************************************************************************************
Систик совершает прерывания с частотой 72МГц/SYSTICK_PRESCALER, для того чтоб прерывания выполнялись 
каждую 1мс SYSTICK_PRESCALER = 72МГц/72кГц = 1000.
Для модуляции в протеусе: необходимо домножить SYSTICK_PRESCALER = 72МГц/(частота МК в протеусе), для того, 
чтобы в протеусе прерывания также соверщались каждую 1мс. В данном случае частота в протеусе 1МГц
***************************************************************************************************/
#define SYSTICK_PRESCALER 1000 * 72
/***************************************************************************************************
Локальные переменные файла
***************************************************************************************************/
static volatile uint32_t timeStampMs = 0;

/***************************************************************************************************
Глобальные функции
***************************************************************************************************/

/**************************************************************************************************
Описание: Инициализация SysTick
Аргументы: Нет
Возврат:   Нет
Замечания: Смотреть описание SYSTICK_PRESCALER
***************************************************************************************************/

void systick_init ( void )
{    
    // настройка приоритета прерываний SysTick
    NVIC_InitTypeDef nvicInitStruct;
    nvicInitStruct.NVIC_IRQChannel = SysTick_IRQn;
    nvicInitStruct.NVIC_IRQChannelCmd = ENABLE;
    nvicInitStruct.NVIC_IRQChannelPreemptionPriority = 0;
    nvicInitStruct.NVIC_IRQChannelSubPriority = 0;
    NVIC_Init( &nvicInitStruct );

    SysTick_Config( SystemCoreClock/SYSTICK_PRESCALER ); 
}

/**************************************************************************************************
Описание: Временная задержка по SysTick
Аргументы: delay - время задержки в мс
Возврат: true - прошло заданное время, false - нет
Замечания: 
***************************************************************************************************/

bool delay_ms(uint32_t delay)
{
    
    if ( timeStampMs < delay )
    {
        return false;
    }
    else
    {
        timeStampMs = 0;
        return true;
    }
}

  /**************************************************************************************************
Описание: Остановка таймера SysTick
Аргументы: Нет
Возврат:   Нет
Замечания: 
***************************************************************************************************/

void systick_stop( void )
{
    SysTick->CTRL &= ~SysTick_CTRL_ENABLE;
}

/**************************************************************************************************
Описание: Запуск таймера SysTick
Аргументы: Нет
Возврат:   Нет
Замечания: 
***************************************************************************************************/

void systick_start( void )
{
    SysTick->CTRL |= SysTick_CTRL_ENABLE;
}
/**************************************************************************************************
Описание: Прерывания по Systick
Аргументы: Нет
Возврат:   Нет
Замечания: 
***************************************************************************************************/
void SysTick_Handler()
{
    timeStampMs++;
}
